ScaleDIN/electroNIX-ESP32/electroNIX/display_nick2.cpp
// ============================================================================
//  display_nick2.cpp — NickTwo IN-12 board (schematic rev 2.0, 2021-03-09)
//
//  Very different plumbing from the TESTA-QUADRA boards:
//
//   - Cathodes are driven through a single 74141 BCD-to-decimal decoder. The
//     ESP32 writes a 4-bit nibble (74141_A/B/C/D) and the chip picks the
//     cathode; nibble 15 makes it blank all outputs, which is the same trick
//     the TESTA back-end uses with digit == 10.
//
//   - Anodes go through PNP high-side switches (MMBTA92) driven by NPN
//     level-shifters. The base network sits on a 470 k / 4 x 200 k / 470 k
//     divider from 170 V — so turn-off is meaningfully slower than direct
//     base drive on the TESTA. The multiplex slot dead-time here is 60 us
//     instead of the TESTA's 25 us to keep ghosting out.
//
//   - HV comes from an NCH8200HV module: sealed, ~170 V, always on when USB
//     is connected. No feedback, no gate, no PWM. The core hides its HV panel
//     because board.h declares BOARD_HAS_HV 0.
//
//   - The board now supports 6 tubes (HH:MM:SS). Anodes 5 and 6 (seconds
//     tens and units) default to GPIO13 and GPIO14. Leave them unwired and
//     the firmware still runs on a 4-tube build, showing HH:MM only.
//
//   - Colon: two options selected by NICK2_USE_NEON in board.h.
//
//     WS2812 mode (NICK2_USE_NEON 0, default):
//       Two 5-LED WS2812B columns daisy-chained on GPIO3 (UART0 RX).
//       Column 0 = HH:MM gap, column 1 = MM:SS gap.
//       LED roles, top to bottom, within each column:
//         LED 0   decorative (above the colon)
//         LED 1   upper colon dot
//         LED 2   decorative (centre)
//         LED 3   lower colon dot
//         LED 4   decorative / time-not-trusted warning (bottom)
//       cfg.colonReversed flips the chain direction without resoldering.
//
//     Neon mode (NICK2_USE_NEON 1):
//       Two neon lamps driven by ledc PWM. Default pins: SEC_0 = GPIO2
//       (upper dot / HH:MM), SEC_1 = GPIO12 (lower dot / MM:SS). Override
//       with #define PIN_NEON0 / PIN_NEON1 in board.h. All colon modes
//       (BLINK, BREATHE, ALTERNATE, STEADY, OFF) work as on the TESTA boards.
//       The time-not-trusted warning blinks SEC_1 regardless of colon mode.
//
//  Multiplex compatibility with the shared core
//  --------------------------------------------
//  The core's cross-fade splits each tube's on-window between the previously
//  displayed digit and the new one. Doing that with a BCD decoder means
//  rewriting the nibble mid-slot rather than swapping GPIO masks — same idea,
//  different implementation. The 74141's propagation delay is well under a
//  microsecond so there's no visible seam.
// ============================================================================
#include "board.h"
#if BOARD == BOARD_NICK2_IN12 || BOARD == BOARD_NICK2_IN12_6T

#include "display.h"
#include "clock_core.h"

// The multiplex ISR writes GPIO.out_w1ts / out1_w1tc directly. Arduino.h does
// not reliably pull in the struct that defines these on every core version.
#if __has_include(<hal/gpio_ll.h>)
  #include <hal/gpio_ll.h>
#endif
#include <soc/gpio_struct.h>

// ---- Pin map ---------------------------------------------------------------
// The NickTwo schematic labels which ESP32 IO connects to which named net,
// though the labels are small and easy to misread. These values were taken
// from the schematic rev 2.0 (2021-03-09):
//
//   74141_A  -> IO4     74141_B  -> IO17    74141_C  -> IO5    74141_D  -> IO16
//   ANODE_1  -> IO32    ANODE_2  -> IO33    ANODE_3  -> IO25   ANODE_4  -> IO26
//   RX_TOP (WS2812)  -> IO3      TX_TOP  -> IO1     GPIO0  -> IO0
//
// If you have a different revision, the runtime override endpoint
//   POST /api/action?do=setpin&kind=an&idx=0&gpio=32
// writes to NVS and reboots. kind=an for anode 0..3, kind=bcd for 74141
// inputs 0..3 (A=0, B=1, C=2, D=3). Or #define PIN_BCD_A etc. in board.h.
#ifndef PIN_BCD_A
  #define PIN_BCD_A  4     // 74141 input A (LSB)
#endif
#ifndef PIN_BCD_B
  #define PIN_BCD_B 17     // 74141 input B
#endif
#ifndef PIN_BCD_C
  #define PIN_BCD_C  5     // 74141 input C
#endif
#ifndef PIN_BCD_D
  #define PIN_BCD_D 16     // 74141 input D (MSB)
#endif
#ifndef PIN_ANODE_1
  #define PIN_ANODE_1 32
#endif
#ifndef PIN_ANODE_2
  #define PIN_ANODE_2 33
#endif
#ifndef PIN_ANODE_3
  #define PIN_ANODE_3 25
#endif
#ifndef PIN_ANODE_4
  #define PIN_ANODE_4 26
#endif
#ifndef PIN_ANODE_5
  #define PIN_ANODE_5 13   // seconds tens tube
#endif
#ifndef PIN_ANODE_6
  #define PIN_ANODE_6 14   // seconds units tube
#endif
#if BOARD_HAS_SECONDS
static uint8_t PIN_ANODE[BOARD_TUBES] = {
  PIN_ANODE_1, PIN_ANODE_2, PIN_ANODE_3, PIN_ANODE_4, PIN_ANODE_5, PIN_ANODE_6
};
#else
static uint8_t PIN_ANODE[BOARD_TUBES] = {
  PIN_ANODE_1, PIN_ANODE_2, PIN_ANODE_3, PIN_ANODE_4
};
#endif

#if !BOARD_HAS_WS2812
// Neon colon pin defaults. Override with #define PIN_NEON0 / PIN_NEON1 in
// board.h. GPIO2 and GPIO12 are free on the Nick2 and not strapping pins.
#ifndef PIN_NEON0
  #define PIN_NEON0  2   // SEC_0 — upper dot / HH:MM colon
#endif
#ifndef PIN_NEON1
  #define PIN_NEON1 12   // SEC_1 — lower dot / MM:SS colon
#endif
static const uint8_t NEON_LEDC_HI = 0;   // ledc channel for SEC_0
static const uint8_t NEON_LEDC_LO = 1;   // ledc channel for SEC_1
#endif
static uint8_t PIN_BCD[4]             = { PIN_BCD_A, PIN_BCD_B, PIN_BCD_C, PIN_BCD_D };
static const uint8_t PIN_WS2812  =  3;    // RX_TOP -- UART0 RX (explicit in the schematic)
static const uint8_t PIN_LIGHT   = 34;    // optional, if a sensor is added
#if BOARD_HAS_WS2812
#define WS2812_COUNT (BOARD_WS_PER_COL * BOARD_WS_COLS)  // total LEDs in chain
#endif

// ---- Multiplex timing ------------------------------------------------------
// 40 kHz ISR. BOARD_TUBES × 62 ticks/slot × 25 µs gives the frame rate:
// ~161 Hz for 4 tubes, ~107 Hz for 6 tubes — both well above the flicker
// threshold. Dead-time is 3 ticks (75 µs) for the slow PNP switches.
static const uint32_t TICK_US       = 25;
static const uint8_t  SLOT_TICKS    = 62;
static const uint8_t  DEAD_TICKS    = 3;
static const uint8_t  ACTIVE_TICKS  = SLOT_TICKS - DEAD_TICKS;
static const uint8_t  BLANK         = 15;

// ---- Pin overrides via NVS -------------------------------------------------
// Written by the /api/action?do=setpin&kind=X&idx=Y&gpio=Z web endpoint (see
// clock_core), so you can correct a wrong pin guess without a rebuild. Reads
// happen once at display_init(); a restart applies changes.
#include <Preferences.h>
void nick2_savePin(const char *kind, uint8_t idx, uint8_t gpio) {
  Preferences p;
  p.begin("nickpins", false);
  char k[6];
  if (!strcmp(kind, "bcd") && idx < 4)      { snprintf(k,sizeof k,"bcd%d",idx); p.putUChar(k, gpio); }
  else if (!strcmp(kind, "an") && idx < BOARD_TUBES) { snprintf(k,sizeof k,"an%d",idx); p.putUChar(k, gpio); }
  p.end();
}

static void loadPinOverrides() {
  Preferences p;
  p.begin("nickpins", true);
  for (int i = 0; i < 4; i++) {
    char k[6]; snprintf(k, sizeof k, "bcd%d", i);
    PIN_BCD[i]   = p.getUChar(k, PIN_BCD[i]);
  }
  for (int i = 0; i < BOARD_TUBES; i++) {
    char k[6]; snprintf(k, sizeof k, "an%d", i);
    PIN_ANODE[i] = p.getUChar(k, PIN_ANODE[i]);
  }
  p.end();
}

// ---- ISR state -------------------------------------------------------------
static volatile DRAM_ATTR uint32_t tubeWord[BOARD_TUBES];  // fade<<16|new<<8|old
static volatile DRAM_ATTR uint8_t  vOnTicks[BOARD_TUBES];
static volatile DRAM_ATTR bool     muxHold = false;
static volatile DRAM_ATTR uint8_t  isrCurBcd = 255;
static volatile DRAM_ATTR uint32_t muxTicks = 0;

