ScaleDIN/electroNIX-ESP32/electroNIX/display_nick2.cpp
static volatile DRAM_ATTR uint32_t bcdMaskSet0[16], bcdMaskSet1[16];
static volatile DRAM_ATTR uint32_t anodeMask0[BOARD_TUBES], anodeMask1[BOARD_TUBES];
static volatile DRAM_ATTR uint32_t allAnodeMask0 = 0, allAnodeMask1 = 0;
static volatile DRAM_ATTR uint32_t allBcdMask0 = 0, allBcdMask1 = 0;
static hw_timer_t *muxTimer = nullptr;

// loop()-owned shadow copies — only loop writes these
static uint8_t shOld[BOARD_TUBES], shNew[BOARD_TUBES], shFade[BOARD_TUBES];
static inline void pushTube(int i) {
  tubeWord[i] = ((uint32_t)shFade[i] << 16) | ((uint32_t)shNew[i] << 8) | shOld[i];
}

// Starts non-zero on purpose -- see the matching comment in display_testa.cpp.
// colonTask already runs independently of the core from display_init()
// onward; this is what makes its output visible before the core's first
// real display_setBrightness() call, which can be up to 20 s away behind
// the blocking WiFi connection attempt.
static uint8_t effBright = 60;

// Fade timeline owned entirely by this back-end. The core just says "fade for
// N ms" and forgets about it; this task walks it forward every 20 ms.
static volatile uint16_t fadeDurMs = 0;
static volatile uint32_t fadeStartMs = 0;
static void fadeTask(void *) {
  for (;;) {
    if (fadeDurMs) {
      uint32_t el = millis() - fadeStartMs;
      uint16_t dur = fadeDurMs;
      // While seconds are counting on a six-tube board, cap the fade so the
      // digit always settles inside its second. On four tubes this is a no-op.
      uint8_t p = (el >= dur) ? 255 : (uint8_t)((el * 255UL) / dur);
      for (int i = 0; i < BOARD_TUBES; i++) {
        if (shOld[i] == shNew[i]) continue;
        shFade[i] = p;
        if (p == 255) shOld[i] = shNew[i];
        pushTube(i);
      }
      if (p == 255) fadeDurMs = 0;
    }
    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

// ---- Wiring order ----------------------------------------------------------
// cfg.cathOrder[d] selects which wired cathode lights digit d; cfg.anodeOrder
// does the same for tube positions. Rebuilt live when the user saves.
static void buildMasks() {
  muxHold = true;
  delayMicroseconds(TICK_US * 2);
  
  GPIO.out_w1tc      = allAnodeMask0;
  GPIO.out1_w1tc.val = allAnodeMask1;
  GPIO.out_w1ts      = allBcdMask0;
  GPIO.out1_w1ts.val = allBcdMask1;
  allAnodeMask0 = allAnodeMask1 = 0;
  allBcdMask0 = allBcdMask1 = 0;
  isrCurBcd = 255;

  for (int i = 0; i < 4; i++) {
    if (PIN_BCD[i] < 32) allBcdMask0 |= 1UL << PIN_BCD[i];
    else                 allBcdMask1 |= 1UL << (PIN_BCD[i] - 32);
  }

  for (int i = 0; i < BOARD_TUBES; i++) {
    uint8_t idx = (cfg.anodeOrder[i] < BOARD_TUBES) ? cfg.anodeOrder[i] : i;
    uint8_t pin = PIN_ANODE[idx];
    anodeMask0[i] = (pin < 32) ? (1UL << pin) : 0;
    anodeMask1[i] = (pin < 32) ? 0 : (1UL << (pin - 32));
    allAnodeMask0 |= anodeMask0[i];
    allAnodeMask1 |= anodeMask1[i];
  }

  for (int logicalD = 0; logicalD < 16; logicalD++) {
    uint32_t m0 = 0, m1 = 0;
    uint8_t physD = logicalD;
    
    if (logicalD < 10) {
      physD = (cfg.cathOrder[logicalD] < 10) ? cfg.cathOrder[logicalD] : logicalD;
    }
    
    if (physD & 1) { if (PIN_BCD[0] < 32) m0 |= 1UL << PIN_BCD[0]; else m1 |= 1UL << (PIN_BCD[0] - 32); }
    if (physD & 2) { if (PIN_BCD[1] < 32) m0 |= 1UL << PIN_BCD[1]; else m1 |= 1UL << (PIN_BCD[1] - 32); }
    if (physD & 4) { if (PIN_BCD[2] < 32) m0 |= 1UL << PIN_BCD[2]; else m1 |= 1UL << (PIN_BCD[2] - 32); }
    if (physD & 8) { if (PIN_BCD[3] < 32) m0 |= 1UL << PIN_BCD[3]; else m1 |= 1UL << (PIN_BCD[3] - 32); }
    
    bcdMaskSet0[logicalD] = m0;
    bcdMaskSet1[logicalD] = m1;
  }
  
  muxHold = false;
}

// ---- The multiplex ISR -----------------------------------------------------
// Writes a BCD nibble and asserts one anode. Cross-fade splits the slot's
// on-window between the old and new nibble, same principle as the TESTA
// back-end but writing 4 pins instead of selecting a cathode mask.
void IRAM_ATTR onMuxTick() {
  static uint8_t slot = 0, tick = 0;
  uint8_t curBcd = isrCurBcd;
  muxTicks++;

  if (++tick >= SLOT_TICKS) { tick = 0; if (++slot >= BOARD_TUBES) slot = 0; }

  if (muxHold) {
    GPIO.out_w1tc      = allAnodeMask0;
    GPIO.out1_w1tc.val = allAnodeMask1;
    GPIO.out_w1ts      = allBcdMask0;
    GPIO.out1_w1ts.val = allBcdMask1;
    isrCurBcd = 255;
    return;
  }

  // Dead-time: turn off the anode, blank the decoder, let the PNP recover.
  if (tick < DEAD_TICKS) {
    if (tick == 0) {
      GPIO.out_w1tc      = allAnodeMask0;
      GPIO.out1_w1tc.val = allAnodeMask1;
      GPIO.out_w1ts      = allBcdMask0;
      GPIO.out1_w1ts.val = allBcdMask1;
      isrCurBcd = BLANK;
    }
    return;
  }

  uint8_t tOn = vOnTicks[slot];
  uint8_t tInSlot = tick - DEAD_TICKS;

  // Fix 1: True 0% duty cycle
  if (tOn == 0) return; 

  // Fix 2: Inclusive bound to prevent the 1-tick pulse on 0
  if (tInSlot >= tOn) {
    if (tInSlot == tOn) {
      // Fix 3: Pull anodes LOW (Clear) but BCD pins HIGH (Set to 1111/15)
      GPIO.out_w1tc      = allAnodeMask0;
      GPIO.out1_w1tc.val = allAnodeMask1;
      GPIO.out_w1ts      = allBcdMask0;
      GPIO.out1_w1ts.val = allBcdMask1;
      isrCurBcd = BLANK;
    }
    return;
  }

  uint32_t w = tubeWord[slot];
  uint8_t oldD = (uint8_t)w, newD = (uint8_t)(w >> 8), fade = (uint8_t)(w >> 16);

  uint8_t newTicks = (uint8_t)(((uint16_t)tOn * fade + 127) / 255);
  uint8_t d = (tInSlot <= (uint8_t)(tOn - newTicks)) ? oldD : newD;
  if (d > 9) d = BLANK;

  if (d != curBcd) {
    GPIO.out_w1tc = allBcdMask0;
    GPIO.out1_w1tc.val = allBcdMask1;
    GPIO.out_w1ts = bcdMaskSet0[d];
    GPIO.out1_w1ts.val = bcdMaskSet1[d];
    isrCurBcd = d;
  }
  if (d != BLANK) {
    GPIO.out_w1ts = anodeMask0[slot];
    GPIO.out1_w1ts.val = anodeMask1[slot];
  } else {
    GPIO.out_w1tc = anodeMask0[slot];
    GPIO.out1_w1tc.val = anodeMask1[slot];
  }
}

// ---- WS2812 driver ---------------------------------------------------------
#if BOARD_HAS_WS2812
// The RMT peripheral generates the 800 kHz one-wire protocol from a small
// buffer so the CPU never has to bit-bang. One rmt_item32_t per bit, colour
// order is G-R-B for WS2812B.
//
// Using the ESP-IDF RMT driver directly (driver/rmt.h) rather than the
// Arduino wrapper (rmtInit / rmt_obj_t), because the wrapper's shape has
// varied between core versions while the IDF API is stable on 2.x and 3.x.
#include <driver/rmt.h>

