ScaleDIN/electroNIX-ESP32/electroNIX/display_nick2.cpp
static const rmt_channel_t WS_CHAN = RMT_CHANNEL_0;
static const uint8_t WS_CLK_DIV   = 4;         // 80 MHz / 4 = 20 MHz -> 50 ns/tick
static rmt_item32_t rmtBuf[WS2812_COUNT * 24];

// Timing at 50 ns/tick: T0H 8 (400 ns), T0L 17 (850 ns), T1H 16 (800 ns),
// T1L 9 (450 ns). WS2812B tolerance is ~150 ns on each edge.
static const rmt_item32_t WS_BIT0 = { .duration0 =  8, .level0 = 1, .duration1 = 17, .level1 = 0 };
static const rmt_item32_t WS_BIT1 = { .duration0 = 16, .level0 = 1, .duration1 =  9, .level1 = 0 };

// px[] is always indexed in LOGICAL top-to-bottom order (0 = top of the
// column .. WS2812_COUNT-1 = bottom), matching the LED-role comment above.
// Physically, whichever LED is first in the data chain gets written first --
// normally that is assumed to be the top one, but cfg.colonReversed flips it
// for boards wired the other way, so every caller can keep thinking in
// logical "top/bottom" terms and never has to know which way the chain runs.
static void ws2812_write_all(uint8_t px[WS2812_COUNT][3]) {
  int off = 0;
  auto pushByte = [&](uint8_t v) {
    for (int i = 7; i >= 0; i--) rmtBuf[off++] = (v & (1 << i)) ? WS_BIT1 : WS_BIT0;
  };
  for (int chainPos = 0; chainPos < WS2812_COUNT; chainPos++) {
    int logical = cfg.colonReversed ? (WS2812_COUNT - 1 - chainPos) : chainPos;
    pushByte(px[logical][1]);   // G
    pushByte(px[logical][0]);   // R
    pushByte(px[logical][2]);   // B
  }
  rmt_write_items(WS_CHAN, rmtBuf, WS2812_COUNT * 24, true);
  // >50 us of low = latch. RMT idles low after the last item, so a small
  // delay before the next write is enough.
  ets_delay_us(60);
}

static void ws2812_clear() {
  uint8_t px[WS2812_COUNT][3] = {{0}};
  ws2812_write_all(px);
}
#endif // BOARD_HAS_WS2812

// ---- Colon control ---------------------------------------------------------
// LED roles, top to bottom. Index 1 and 3 are the colon dots; 0, 2 and 4 are
// the decorative LEDs above, between and below them. The "time not trusted"
// warning uses LED 4 -- the extreme bottom of the column -- rather than
// either colon dot, so it reads as a distinct indicator light instead of an
// odd-looking colon. The real colon is held off for as long as the warning
// is showing, so it's the only thing moving on the board.
// LED roles, top to bottom within one column. Index 1 and 3 are the colon
// dots; 0, 2 and 4 are the decorative LEDs above, between and below them.
// The "time not trusted" warning uses LED 4.
#if BOARD_HAS_WS2812
static const uint8_t COLON_DOT_HI   = BOARD_WS_HI_IDX;
static const uint8_t COLON_DOT_LO   = BOARD_WS_LO_IDX;
static const uint8_t COLON_WARN_LED = BOARD_WS_WRN_IDX;
#endif
static ColonMode colonMode = COLON_BLINK;

// ---- Colon task: shared animation math, WS2812 or neon output -------------
static void colonTask(void *) {
#if BOARD_HAS_WS2812
  static float   dsError[WS2812_COUNT][3] = {{0}};
  static uint8_t lastPx [WS2812_COUNT][3] = {{0}};
#endif

  for (;;) {
    if (muxHold) { vTaskDelay(pdMS_TO_TICKS(10)); continue; }

    float    base = (effBright / 100.0f) * (cfg.colonBr / 100.0f);
    bool     even = core_secondIsEven();
    uint16_t ms   = core_msIntoSecond();

    uint16_t fMs = cfg.fadeMs;
    if (fMs == 0) fMs = 1;
    if (fMs > 1000) fMs = 1000;
    float p = (float)ms / fMs;
    if (p > 1.0f) p = 1.0f;

    float floor_k = cfg.fadeCurveFloor / 100.0f;
    auto applyGamma = [&](float t) -> float {
      switch (cfg.fadeCurve) {
        case 1: return sqrtf(t);
        case 2: return t * t * (3.0f - 2.0f * t);
        default: return t * t * t;
      }
    };
    auto applyFadeCurve = [&](float t) -> float {
      return floor_k + (1.0f - floor_k) * applyGamma(t);
    };
    float g_on  = applyFadeCurve(p);
    float g_off = applyFadeCurve(1.0f - p);

    // ---- Shared animation state -------------------------------------------
    float hi = 0, lo = 0, warn = 0, centerGlow = 0;
    bool untrusted = !core_timeTrusted();
    if (untrusted) warn = even ? g_on : g_off;

    switch (colonMode) {
      case COLON_OFF:                                          break;
      case COLON_STEADY:    hi = lo = 1.0f;                   break;
      case COLON_BLINK:     hi = lo = even ? g_on : g_off;    break;
      case COLON_ALTERNATE: hi =  even ? g_on : g_off;
                            lo =  even ? g_off : g_on;        break;
      case COLON_BREATHE: {
        float breatheFloor = cfg.accentDim / 100.0f;
        float t = (ms / 1000.0f + (even ? 0.0f : 1.0f)) * 0.5f;
        float cosineK = 0.5f - 0.5f * cosf(t * 6.283185f);
        hi = lo = breatheFloor + (1.0f - breatheFloor) * applyGamma(cosineK);
        break;
      }
      case COLON_CENTERGLOW: {
        float outerFrac    = cfg.colonOuterPct / 100.0f;
        float breatheFloor = cfg.accentDim / 100.0f;
        float t = (ms / 1000.0f + (even ? 0.0f : 1.0f)) * 0.5f;
        float cosineK = 0.5f - 0.5f * cosf(t * 6.283185f);
        centerGlow = breatheFloor + (1.0f - breatheFloor) * applyGamma(cosineK);
        hi = lo    = centerGlow * sqrtf(cfg.colonOuterPct / 100.0f);
        break;
      }
    }
    if (untrusted) { hi = 0; lo = 0; }

#if BOARD_HAS_WS2812
    // ---- WS2812 output: render all columns (one per colon position) --------
    uint8_t px[WS2812_COUNT][3] = {{0}};

    // Delta-sigma quantiser: maps a 0..1 brightness to an 8-bit RGB triplet
    // with error diffusion so fractional targets dither smoothly.
    auto setLed = [&](int i, float k) {
      float maxComp = fmaxf(fmaxf((float)cfg.colonR, (float)cfg.colonG),
                            fmaxf((float)cfg.colonB, 1.0f));
      float target       = base * k;
      float totalIntensity = target * maxComp;
      float dampening    = (totalIntensity < 0.15f) ? totalIntensity / 0.15f : 1.0f;
      float idealR = cfg.colonR * target + dsError[i][0] * dampening;
      float idealG = cfg.colonG * target + dsError[i][1] * dampening;
      float idealB = cfg.colonB * target + dsError[i][2] * dampening;
      uint8_t r = (idealR >= 255) ? 255 : (idealR <= 0 ? 0 : (uint8_t)idealR);
      uint8_t g = (idealG >= 255) ? 255 : (idealG <= 0 ? 0 : (uint8_t)idealG);
      uint8_t b = (idealB >= 255) ? 255 : (idealB <= 0 ? 0 : (uint8_t)idealB);
      dsError[i][0] = idealR - r;
      dsError[i][1] = idealG - g;
      dsError[i][2] = idealB - b;
      px[i][0] = r; px[i][1] = g; px[i][2] = b;
    };

    float acc = 0;
    if (!untrusted) {
      if      (cfg.colonAccent == 1) { float d = cfg.accentDim / 100.0f; acc = d * sqrtf(d); }
      else if (cfg.colonAccent == 2) { acc = (colonMode != COLON_ALTERNATE) ? fmaxf(hi, lo) : 0; }
    }

    for (int col = 0; col < BOARD_WS_COLS; col++) {
      int off = col * BOARD_WS_PER_COL;
      if (colonMode == COLON_CENTERGLOW && !untrusted) {
        float outerFrac = cfg.colonOuterPct / 100.0f;
        setLed(off + 2,              centerGlow);
        setLed(off + 0,              centerGlow * outerFrac);
        setLed(off + COLON_WARN_LED, centerGlow * outerFrac);
        setLed(off + COLON_DOT_HI,   hi);
        setLed(off + COLON_DOT_LO,   lo);
      } else {
        setLed(off + COLON_DOT_HI, hi);
        setLed(off + COLON_DOT_LO, lo);
        if (acc > 0) {
          setLed(off + 0, acc);
          setLed(off + 2, acc);
          if (!untrusted) setLed(off + COLON_WARN_LED, acc);
        }
        if (untrusted) setLed(off + COLON_WARN_LED, warn);
      }
    }

    bool changed = false;
    for (int i = 0; i < WS2812_COUNT; i++)
      for (int j = 0; j < 3; j++)
        if (px[i][j] != lastPx[i][j]) { changed = true; lastPx[i][j] = px[i][j]; }
    if (changed) ws2812_write_all(px);

#else
    // ---- Neon output: two ledc channels, one per colon dot ----------------
    // Map the same 0..1 float range to 0..255 ledc duty. The warning blink
    // goes on NEON_LEDC_LO (SEC_1) so it uses a dedicated neon rather than
    // fighting the colon output.
    ledcWrite(NEON_LEDC_HI, (uint8_t)(base * hi   * 255));
    ledcWrite(NEON_LEDC_LO, untrusted ? (uint8_t)(base * warn * 255)
                                       : (uint8_t)(base * lo   * 255));
#endif

    vTaskDelay(pdMS_TO_TICKS(2));
  }
}

// ---- Interface implementation ---------------------------------------------

void display_init() {
  // Load any pin overrides that were saved via the web action.
  loadPinOverrides();

