ScaleDIN/electroNIX-ESP32/electroNIX/display_nick2.cpp
  for (int i = 0; i < 4; i++)          { pinMode(PIN_BCD[i],   OUTPUT); digitalWrite(PIN_BCD[i],   LOW); }
  for (int i = 0; i < BOARD_TUBES; i++) { pinMode(PIN_ANODE[i], OUTPUT); digitalWrite(PIN_ANODE[i], LOW); }

  buildMasks();

  for (int i = 0; i < BOARD_TUBES; i++) {
    shOld[i] = shNew[i] = BLANK; shFade[i] = 255; pushTube(i); vOnTicks[i] = 0;
  }

#if BOARD_HAS_WS2812
  // WS2812 chain via RMT (ESP-IDF driver, stable across core 2.x and 3.x)
  rmt_config_t rc = {};
  rc.rmt_mode                = RMT_MODE_TX;
  rc.channel                 = WS_CHAN;
  rc.gpio_num                = (gpio_num_t)PIN_WS2812;
  rc.clk_div                 = WS_CLK_DIV;
  rc.mem_block_num           = 1;
  rc.tx_config.loop_en       = false;
  rc.tx_config.carrier_en    = false;
  rc.tx_config.idle_output_en= true;
  rc.tx_config.idle_level    = RMT_IDLE_LEVEL_LOW;
  rmt_config(&rc);
  rmt_driver_install(WS_CHAN, 0, 0);
  ws2812_clear();
#else
  // Neon colons via ledc PWM at 1 kHz, 8-bit resolution.
  // ledcAttach(pin, freq, bits) is the core 3.x API. On core 2.x you need:
  //   ledcSetup(NEON_LEDC_HI, 1000, 8); ledcAttachPin(PIN_NEON0, NEON_LEDC_HI);
  //   ledcSetup(NEON_LEDC_LO, 1000, 8); ledcAttachPin(PIN_NEON1, NEON_LEDC_LO);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(PIN_NEON0, 1000, 8);
  ledcAttach(PIN_NEON1, 1000, 8);
#else
  ledcSetup(NEON_LEDC_HI, 1000, 8); ledcAttachPin(PIN_NEON0, NEON_LEDC_HI);
  ledcSetup(NEON_LEDC_LO, 1000, 8); ledcAttachPin(PIN_NEON1, NEON_LEDC_LO);
#endif
  ledcWrite(NEON_LEDC_HI, 0);
  ledcWrite(NEON_LEDC_LO, 0);
#endif

  xTaskCreatePinnedToCore(fadeTask,  "fade",  2048, nullptr, 2, nullptr, 1);
  xTaskCreatePinnedToCore(colonTask, "colon", 2048, nullptr, 3, nullptr, 1);

  // Multiplex timer
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  muxTimer = timerBegin(1000000);
  timerAttachInterrupt(muxTimer, &onMuxTick);
  timerAlarm(muxTimer, TICK_US, true, 0);
#else
  muxTimer = timerBegin(0, 80, true);
  timerAttachInterrupt(muxTimer, &onMuxTick, true);
  timerAlarmWrite(muxTimer, TICK_US, true);
  timerAlarmEnable(muxTimer);
#endif
}

void display_setDigits(const uint8_t digits[BOARD_TUBES], uint16_t fadeMs) {
  bool changed = false;
  for (int i = 0; i < BOARD_TUBES; i++) {
    if (shNew[i] == digits[i] && shOld[i] == digits[i]) continue;
    // If a fade was in progress the "old" value should be whatever is
    // currently visible, so the display doesn't snap backwards.
    shOld[i]  = fadeMs ? shNew[i] : digits[i];
    shNew[i]  = digits[i];
    shFade[i] = fadeMs ? 0 : 255;
    pushTube(i);
    changed = true;
  }
  if (!changed) return;
  if (fadeMs) { fadeStartMs = millis(); fadeDurMs = fadeMs; }
  else        { fadeDurMs = 0; }
}

void display_setColon(ColonMode mode) { colonMode = mode; }

void display_setBrightness(uint8_t percent) {
  effBright = percent;
  // Perceptual gamma, then per-tube trim
  uint16_t g = ((uint16_t)percent * percent) / 100;
  for (int i = 0; i < BOARD_TUBES; i++) {
    uint16_t v = ((uint16_t)ACTIVE_TICKS * g) / 100;
    v = (v * cfg.trim[i]) / 100;
    if (percent > 0 && v == 0) v = 1;
    vOnTicks[i] = (uint8_t)v;
  }
}

void display_tick_100ms() {
  // Re-apply the wiring order if the user changed it in the web UI.
  static uint8_t lastCath[10], lastAnode[BOARD_TUBES];
  static bool first = true;
  if (first || memcmp(lastCath, cfg.cathOrder, 10) || memcmp(lastAnode, cfg.anodeOrder, BOARD_TUBES)) {
    memcpy(lastCath, cfg.cathOrder, 10);
    memcpy(lastAnode, cfg.anodeOrder, BOARD_TUBES);
    if (!first) buildMasks();
    first = false;
  }
}

static uint16_t muxHealth = 100, muxMin = 100;
void display_tick_1s() {
  uint32_t t = muxTicks; muxTicks = 0;
  uint32_t expect = 1000000UL / TICK_US;
  muxHealth = (uint16_t)((t * 100 + expect / 2) / expect);
  if (muxHealth < muxMin) muxMin = muxHealth;
}

void display_park(bool parked) {
  muxHold = parked;
  if (parked) {
#if BOARD_HAS_WS2812
    ws2812_clear();
#else
    ledcWrite(NEON_LEDC_HI, 0);
    ledcWrite(NEON_LEDC_LO, 0);
#endif
  } else {
    isrCurBcd = 255;
  }
}

void display_snapshot(char *out, int n) {
  int m = BOARD_TUBES < n - 1 ? BOARD_TUBES : n - 1;
  for (int i = 0; i < m; i++)
    out[i] = (shNew[i] <= 9) ? ('0' + shNew[i]) : ' ';
  out[m] = 0;
}

void display_getStatus(DisplayStatus &s) {
  s.hv        = 0;          // NCH8200HV is sealed: nothing to report
  s.duty      = 0;
  s.hvFault   = false;
  s.hvCuts    = 0;
  s.muxHealth = muxHealth;
  s.muxMin    = muxMin;
  bool even   = core_secondIsEven();
  // colon0/colon1 track the two real colon dots. They're forced off during
  // the "time not trusted" warning, same as the real hardware -- see
  // colonTask -- so the preview doesn't show them animating while the
  // actual LEDs are dark. The warning LED itself lives on its own dedicated
  // lamp (see the file header), which this two-dot preview has no slot for
  // and so doesn't show either way.
  if (!core_timeTrusted()) {
    s.colon0 = false;
    s.colon1 = false;
  } else {
    s.colon0  = (colonMode == COLON_STEADY) || (colonMode == COLON_BREATHE) ||
                (colonMode == COLON_BLINK && even) ||
                (colonMode == COLON_ALTERNATE && even);
    s.colon1  = (colonMode == COLON_STEADY) || (colonMode == COLON_BREATHE) ||
                (colonMode == COLON_BLINK && even) ||
                (colonMode == COLON_ALTERNATE && !even);
  }
  s.hasLight  = false;      // no sensor on this board
  s.lightMv   = 0;
  s.lightPP   = 0;
}

// ---- Sanity checks --------------------------------------------------------
#if BOARD_HAS_HV || BOARD_HAS_BUZZER
  #error "board.h capabilities disagree with display_nick2.cpp"
#endif

#endif // BOARD == BOARD_NICK2_IN12